read_verilog cpu.v alu32.v regfile.v dummydecoder.v
synth_xilinx -top cpu
write_verilog cpu_synth.v

